import '../../../../core/src/app_export.dart';

class CustomTermBody extends StatelessWidget {
  const CustomTermBody({super.key});

  @override
  Widget build(BuildContext context) {
    return BlocBuilder<OtherPageCubit, OtherPageState>(
      builder: (context, state) {
        if (state is TermsLoading) {
          return const Center(
            child: CustomLoading(),
          );
        }
        if (state is TermsSuccess) {
          return Column(
            mainAxisAlignment: MainAxisAlignment.start,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Gap(8.h),
              // Text(
              //   "الشروط والأحكام",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c090909,
              //       size: 16),
              // ),
              // Gap(8.h),
              Text(
                context.read<OtherPageCubit>().termsContent ?? "",
                style: AppTextStyles.textStyle(
                    weight: FontWeight.w500,
                    color: AppColors.c9A9A9A,
                    height: 1.8,
                    size: 11),
              ),


              // Gap(25.h),
              // Text(
              //   "الالتزامات الخاصة بك",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c090909,
              //       size: 16),
              // ),
              // Gap(8.h),
              // Text(
              //   "عند استخدامك للتطبيق أو وصولك إليه، فأنت توافق على ما يلي:",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c9A9A9A,
              //       height: 1.8,
              //       size: 11),
              // ),
              // Text(
              //   "1. مسؤوليتك عن الحفاظ على الخصوصية وتقييد الوصول إلى الحساب الخاص بك واستخدامه هو وكلمة المرور، والموافقة على تحمل مسؤولية جميع الأنشطة التي تتم باسم الحساب الخاص بك وكلمة المرور الخاصة بك.\n"
              //       "2. الموافقة على إخطارنا فورا عن أي استخدام غير مصرح به لكلمة المرور أو الحساب الخاص بك أو أي خرقٍ آخر لمعايير الاستخدام الآمن للموقع.\n"
              //       "3. تقديم المعلومات الكاملة والحقيقية والدقيقة والحالية عن نفسك وعن استخدامك للخدمات كما هو محدد من قبلنا.\n"
              //       "4. عدم الإفصاح للغير (باستثناء ما يلزم أو ما هو محدد من قبلنا) عن معلومات المستخدم المقدمة لك.\n"
              //       "5. التعاون مع الطلبات الصادرة عنا للحصول على معلومات إضافية فيما يتعلق بأهليتكك واستخدامك لخدماتنا.\n"
              //       "6. عند استخدامك للخدمات أو وصولك إليها، فأنت توافق على أنك لن تقوم بما يلي:\n"
              //       "7. خرق القانون أو التحايل عليه، أو خرق أي من حقوق الغير أو الأنظمة الخاصة بنا أو السياسات أو خرق القرارات المتعلقة بحالة الحساب الخاص بك.\n"
              //       "8. استخدام الخدمات إذا لم تعد تستوفي معايير أهلية الاستخدام أو كنتَ غير قادر على إبرام عقود ملزمة قانونياً أو تم ايقاف حسابك بشكلٍ مؤقت أو لأجلٍ غير مسمى.\n"
              //       "9. عدم تسديدك ثمن المنتجات التي قمت بشرائها، إلا إذا كان هناك سبب قانوني يؤدي ذلك في أي من السياسات الخاصة بنا.\n"
              //       "10. نقل الحساب الخاص بك إلى طرف آخر دون الحصول على موافقة خطية مسبقة من قبلنا.",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c9A9A9A,
              //       height: 1.8,
              //       size: 11),
              // ),
              //
              //
              // Gap(25.h),
              // Text(
              //   "أحكام عامة",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c090909,
              //       size: 16),
              // ),
              // Gap(8.h),
              // Text(
              //   "عند استخدامك للتطبيق أو وصولك إليه، فأنت توافق على ما يلي:",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c9A9A9A,
              //       height: 1.8,
              //       size: 11),
              // ),
              // Text(
              //   "1. القانون المطبق: إن شروط الاستخدام هذه وأياً من الحقوق أو الواجبات غير التعاقدية ذات الصلة يجب إخضاعها وتفسيرها للقوانين المطبقة في العراق.\n"
              //       "2. حل النزاعات: إذا كان لديك أي من المشكلات الخاصة بخدماتنا يُرجى الاتصال بنا‎. وسنعمل جاهدين على حل المشكلة التي تواجهك في أقرب فرصة ممكنة. يتم تسوية أي من النزاعات أو الخلافات المتعلقة بشروط الاستخدام هذه، بما في ذلك أي حقوق أو واجبات غير تعاقدية ذات صلة عن طريق محاكم العراق.\n"
              //       "3. حقوق الغير: الشخص الذي لا يُعد جزءاً من شروط الاستخدام هذه ليس لديه أي حق في تنفيذ أي من شروطها.\n"
              //       "4. التأكيدات الإضافية: تقوم الأطراف بالتصرفات اللازمة أو الترتيب لاتخاذ التصرفات اللازمة وتحرير المستندات وغيرها من الأمور التي تقع ضمن سلطتها من أجل إنفاذ شروط الاستخدام هذه والتحقق من العمل بها، بما في ذلك على سبيل المثال لا الحصر مساعدة كل طرف على الالتزام بالقانون المعمول به.\n"
              //       "5. مجمل الاتفاق: إن شروط الاستخدام هذه والوثائق المشار إليها أو المدرجة في شروط الاستخدام تمثل مجمل الاتفاق بين الأطراف فيما يتعلق بموضوع الاتفاقية وتسمو على وتحجب جميع الاتفاقيات والمفاوضات والإقرارات السابقة، الخطية أو الشفهية، ذات الصلة بالموضوع. باستثناء ما هو محدد في شروط الاستخدام والوثائق المشار إليها أو المدرجة في شروط الاستخدام الماثلة فلا توجد أي شروط أو إقرارات أو ضمانات أو تعهدات أو اتفاقيات بين الأطراف سواء كان ذلك مباشراً أو غير مباشر أو جماعياً أو صريحاً أو ضمنياً.\n"
              //       "5. التعديلات: لا يحق إجراء أي تعديل على شروط الاستخدام هذه أو إدخال أي إضافة أو تكملتها. نحن نحتفظ بالحق في إدخال أي تعديل أو تغيير أو إضافة أو إكمال شروط الاستخدام هذه في أي وقت أو من وقتٍ لآخر. وسنقوم بنشر النسخة الحالية لشروط الاستخدام على الموقع وستكون سارية المفعول عند نشرها على الموقع أو بناء على الموعد المحدد من جانبنا بصفته تاريخ السريان  (إن وجد). إن استخدامك المستمر للخدمات في حال حدوث أي تغييرات يُعد موافقة منك على الالتزام بشروط الاستخدام المعدلة.\n"
              //       "7. قابلية الفصل بين البنود: إذا ما تم اعتبار أي من أحكام شروط الاستخدام هذه ملغًى من قبل أيٍّ من المحاكم المختصة أو غير قانوني أو غير معمول به فإنه يتم إلغاء هذا لبند من شروط الاستخدام هذه وتستمر باقي الشروط والأحكام قائمة سارية نافذة طالما ظل الجوهر القانوني والاقتصادي للصفقات التي تمت تحت شروطها قائماً دون أي تأثير معاكس على أطرافها.\n"
              //       "8. القوة القاهرة: لا يتحمل أي طرف مسؤولية وجود الخسارة أو الضرر أو التأخير أو عدم الوفاء نتيجة للأعمال الخارجة عن السيطرة لأي من الأطراف سواء كان ذلك العمل يمكن توقعه (مثل القضاء والقدر والإجراءات الصادرة عن السلطات التشريعية أو القضائية أو التنظيمية لأي من الحكومة الفيدرالية أو المحلية أو السلطات القضائية أو الإجراءات التي يقوم بها أي من المقاولين من الباطن التابعين لنا أو أي طرف ثالث مورد البضائع أو الخدمات لنا أو الاضطرابات العمالية أو الانقطاع الكامل للتيار الكهربائي أو المقاطعة الاقتصادية.\n"
              //       "9. عدم التنازل: إن التنازل عن أي من الأحكام الواردة في شروط الاستخدام لا يُعد تنازلاً عن أي من الأحكام الأخرى (المشابهة أو غير المشابهة)، ولا يعد أي تنازل آخر تنازلاً مستمراً عن أي من الأحكام المعنية، ما لم ننص على ذلك صراحة وخطياً.\n"
              //       "10. التواصل: يمكنك التواصل معنا عبر البريد الإلكتروني، أو عبر مواقع التواصل الاجتماعي الخاص بنا ، أو الاتصال بمركز الاتصال الخاص بنا على الرقم 123456789",
              //   style: AppTextStyles.textStyle(
              //       weight: FontWeight.w500,
              //       color: AppColors.c9A9A9A,
              //       height: 1.8,
              //       size: 11),
              // ),
            ],
          );
        }
        else {
          return const Center(
            child: CustomLoading(),
          );
        }
      },
    );
  }
}